Project/Toir/src/Catalogs/ИсходящиеСообщения/ИсходящиеСообщения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИсходящиеСообщения</name>
  <attributes>
    <name>ДатаВремяСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УниверсальнаяДатаСобытияВМиллисекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаПубликации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючМаршрутизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВремяОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Сообщение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СерверОчередей</name>
    <type>
      <types>CatalogRef.СерверыОчередейRMQ</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваСообщения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКлючСоединения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КорневойИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Хоп</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ОбъектСобытия</name>
    <type>
      <types>AnyRef</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_НастройкаПолучателя</name>
    <type>
      <types>CatalogRef.гкс_ПолучателиДанныхRMQ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКонтракта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСостав</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыгруженныеОбъекты</name>
    <attributes>
      <name>Объект</name>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir/src/InformationRegisters/гкс_СостоянияИсходящихСообщений/гкс_СостоянияИсходящихСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_СостоянияИсходящихСообщений</name>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.гкс_СостоянияИсходящихСообщенийRMQ</types>
    </type>
  </resources>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МестноеВремя</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сообщение</name>
    <type>
      <types>CatalogRef.ИсходящиеСообщения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УчастникОбмена</name>
    <type>
      <types>CatalogRef.гкс_УчастникиОбменаRMQ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УниверсальнаяДатаСобытияВМиллисекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/гкс_ТекущиеСостоянияСообщений/гкс_ТекущиеСостоянияСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_ТекущиеСостоянияСообщений</name>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.гкс_СостоянияВходящихСообщенийRMQ</types>
      <types>EnumRef.гкс_СостоянияИсходящихСообщенийRMQ</types>
    </type>
  </resources>
  <dimensions>
    <name>Сообщение</name>
    <type>
      <types>CatalogRef.ИсходящиеСообщения</types>
      <types>CatalogRef.гкс_ВходящиеСообщенияRMQ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипСообщения</name>
    <type>
      <types>EnumRef.гкс_ТипыСообщений</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Catalogs/ИсходящиеСообщения/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	гкс_ФормыОбъектовИАС.ПриСозданииНаСервереФормыСпискаСообщений(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьИдентификаторов();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если (ИмяСобытия = "ИзменениеСостоянийСообщений" И Параметр = "Справочник.ИсходящиеСообщения")
		ИЛИ ИмяСобытия = "ПовторноСформированныСообщенияПоОбъектамСобытий" Тогда
		Элементы.Список.Обновить();	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказатьИдентификаторы(Команда)

	Элементы.ПоказатьИдентификаторы.Пометка = НЕ Элементы.ПоказатьИдентификаторы.Пометка;
	УстановитьВидимостьИдентификаторов();
	 	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиТекущиеСостоянияСообщений(Команда)
	ПеренестиТекущиеСостоянияСообщенийСервер();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "Состояние" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Отбор = Новый Структура("Сообщение", Элементы.Список.ТекущаяСтрока);
				
		ОткрытьФорму("РегистрСведений.гкс_СостоянияИсходящихСообщений.ФормаСписка",
		Новый Структура("Отбор, ИсторияСообщения", Отбор, Истина),
		ЭтотОбъект,
		ЭтотОбъект.УникальныйИдентификатор,
		,
		,
		Новый ОписаниеОповещения("ОбновитьСписок", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьСписок(Результат, ДополнительныеПараметры) Экспорт
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьИдентификаторов()
	
	Элементы.ИдентификаторСообщения.Видимость = Элементы.ПоказатьИдентификаторы.Пометка;
	Элементы.КорневойИдентификаторСообщения.Видимость = Элементы.ПоказатьИдентификаторы.Пометка;
		
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПеренестиТекущиеСостоянияСообщенийСервер()
	
	НачатьТранзакцию();
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.гкс_СостоянияИсходящихСообщений");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();
		
		ВыборкаЗаписей = СформироватьВыборкуТекущихСостоянийИсходящихСообщений();
		
		Набор = РегистрыСведений.гкс_ТекущиеСостоянияСообщений.СоздатьНаборЗаписей();
		
		Пока ВыборкаЗаписей.Следующий() Цикл
			
			Запись = Набор.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, ВыборкаЗаписей);
			
		КонецЦикла;
		
		Набор.Записать();
		
		ЗафиксироватьТранзакцию();
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = Нстр("ru = 'Перенос состояний произведен успешно.'");
		Сообщение.Сообщить();
		
	Исключение
		
		ОтменитьТранзакцию();
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Перенос состояний исходящих сообщений'"),
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
			
		ВызватьИсключение ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
			
	КонецПопытки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СформироватьВыборкуТекущихСостоянийИсходящихСообщений()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СостоянияИсходящихСообщений.Сообщение КАК Сообщение,
	|	СостоянияИсходящихСообщений.УчастникОбмена КАК УчастникОбмена,
	|	МАКСИМУМ(СостоянияИсходящихСообщений.УниверсальнаяДатаСобытияВМиллисекундах) КАК УниверсальнаяДатаСобытияВМиллисекундах
	|ПОМЕСТИТЬ ВТ_МаксимыльныеСостояния
	|ИЗ
	|	РегистрСведений.гкс_СостоянияИсходящихСообщений КАК СостоянияИсходящихСообщений
	|
	|СГРУППИРОВАТЬ ПО
	|	СостоянияИсходящихСообщений.Сообщение,
	|	СостоянияИсходящихСообщений.УчастникОбмена
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сообщение,
	|	УчастникОбмена,
	|	УниверсальнаяДатаСобытияВМиллисекундах
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаксимыльныеСостояния.Сообщение КАК Сообщение,
	|	МаксимыльныеСостояния.УчастникОбмена КАК УчастникОбмена,
	|	МаксимыльныеСостояния.УниверсальнаяДатаСобытияВМиллисекундах КАК УниверсальнаяДатаСобытияВМиллисекундах,
	|	СостоянияИсходящихСообщений.Состояние КАК Состояние
	|ИЗ
	|	ВТ_МаксимыльныеСостояния КАК МаксимыльныеСостояния
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.гкс_СостоянияИсходящихСообщений КАК СостоянияИсходящихСообщений
	|		ПО (МаксимыльныеСостояния.Сообщение = СостоянияИсходящихСообщений.Сообщение
	|				И МаксимыльныеСостояния.УчастникОбмена = СостоянияИсходящихСообщений.УчастникОбмена
	|				И МаксимыльныеСостояния.УниверсальнаяДатаСобытияВМиллисекундах = СостоянияИсходящихСообщений.УниверсальнаяДатаСобытияВМиллисекундах)";
	
	Возврат Запрос.Выполнить().Выбрать();

КонецФункции

#КонецОбласти
